; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-2nodes-1000size-3degree-100mindistance-5trucks-6packages-1236seed

(define (problem transport-three-cities-sequential-2nodes-1000size-3degree-100mindistance-5trucks-6packages-1236seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  truck-5 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 757,682 -> 546,488
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 29)
  ; 546,488 -> 757,682
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 29)
  ; 2988,884 -> 2809,788
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 21)
  ; 2809,788 -> 2988,884
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 21)
  ; 1547,2109 -> 1488,2267
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 17)
  ; 1488,2267 -> 1547,2109
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 17)
  ; 757,682 <-> 2809,788
  (road city-1-loc-2 city-2-loc-1)
  (= (road-length city-1-loc-2 city-2-loc-1) 206)
  (road city-2-loc-1 city-1-loc-2)
  (= (road-length city-2-loc-1 city-1-loc-2) 206)
  (road city-1-loc-1 city-3-loc-1)
  (= (road-length city-1-loc-1 city-3-loc-1) 229)
  (road city-3-loc-1 city-1-loc-1)
  (= (road-length city-3-loc-1 city-1-loc-1) 229)
  (road city-2-loc-2 city-3-loc-1)
  (= (road-length city-2-loc-2 city-3-loc-1) 206)
  (road city-3-loc-1 city-2-loc-2)
  (= (road-length city-3-loc-1 city-2-loc-2) 206)
  (at package-1 city-3-loc-2)
  (at package-2 city-3-loc-2)
  (at package-3 city-1-loc-1)
  (at package-4 city-1-loc-2)
  (at package-5 city-3-loc-1)
  (at package-6 city-1-loc-2)
  (at truck-1 city-3-loc-1)
  (capacity truck-1 capacity-3)
  (at truck-2 city-1-loc-1)
  (capacity truck-2 capacity-2)
  (at truck-3 city-1-loc-2)
  (capacity truck-3 capacity-3)
  (at truck-4 city-3-loc-1)
  (capacity truck-4 capacity-4)
  (at truck-5 city-3-loc-1)
  (capacity truck-5 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-1)
  (at package-2 city-2-loc-2)
  (at package-3 city-3-loc-2)
  (at package-4 city-3-loc-2)
  (at package-5 city-1-loc-1)
  (at package-6 city-3-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-3 city-1-loc-2 package-6 capacity-2 capacity-3)
   deleted: (at package-6 city-1-loc-2) (capacity truck-3 capacity-3)
   added: (in package-6 truck-3) (capacity truck-3 capacity-2)
   goals met: 0 of 6
2. (pick-up truck-3 city-1-loc-2 package-4 capacity-1 capacity-2)
   deleted: (at package-4 city-1-loc-2) (capacity truck-3 capacity-2)
   added: (in package-4 truck-3) (capacity truck-3 capacity-1)
   goals met: 0 of 6
3. (drive truck-3 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-3 city-1-loc-2)
   added: (at truck-3 city-1-loc-1)
   goals met: 0 of 6
4. (pick-up truck-3 city-1-loc-1 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-1-loc-1) (capacity truck-3 capacity-1)
   added: (in package-3 truck-3) (capacity truck-3 capacity-0)
   goals met: 0 of 6
5. (drive truck-3 city-1-loc-1 city-3-loc-1)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-3-loc-1)
   goals met: 0 of 6
6. (drive truck-3 city-3-loc-1 city-3-loc-2)
   deleted: (at truck-3 city-3-loc-1)
   added: (at truck-3 city-3-loc-2)
   goals met: 0 of 6
7. (drop truck-3 city-3-loc-2 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-3) (capacity truck-3 capacity-0)
   added: (at package-4 city-3-loc-2) (capacity truck-3 capacity-1)
   goals met: 1 of 6
8. (pick-up truck-3 city-3-loc-2 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-3-loc-2) (capacity truck-3 capacity-1)
   added: (in package-2 truck-3) (capacity truck-3 capacity-0)
   goals met: 1 of 6
9. (drop truck-3 city-3-loc-2 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-3) (capacity truck-3 capacity-0)
   added: (at package-3 city-3-loc-2) (capacity truck-3 capacity-1)
   goals met: 2 of 6
10. (pick-up truck-3 city-3-loc-2 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-3-loc-2) (capacity truck-3 capacity-1)
   added: (in package-1 truck-3) (capacity truck-3 capacity-0)
   goals met: 2 of 6
11. (pick-up truck-1 city-3-loc-1 package-5 capacity-2 capacity-3)
   deleted: (at package-5 city-3-loc-1) (capacity truck-1 capacity-3)
   added: (in package-5 truck-1) (capacity truck-1 capacity-2)
   goals met: 2 of 6
12. (drive truck-3 city-3-loc-2 city-3-loc-1)
   deleted: (at truck-3 city-3-loc-2)
   added: (at truck-3 city-3-loc-1)
   goals met: 2 of 6
13. (drive truck-1 city-3-loc-1 city-1-loc-1)
   deleted: (at truck-1 city-3-loc-1)
   added: (at truck-1 city-1-loc-1)
   goals met: 2 of 6
14. (drop truck-1 city-1-loc-1 package-5 capacity-2 capacity-3)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-2)
   added: (at package-5 city-1-loc-1) (capacity truck-1 capacity-3)
   goals met: 3 of 6
15. (drop truck-3 city-3-loc-1 package-6 capacity-0 capacity-1)
   deleted: (in package-6 truck-3) (capacity truck-3 capacity-0)
   added: (at package-6 city-3-loc-1) (capacity truck-3 capacity-1)
   goals met: 4 of 6
16. (drive truck-3 city-3-loc-1 city-2-loc-2)
   deleted: (at truck-3 city-3-loc-1)
   added: (at truck-3 city-2-loc-2)
   goals met: 4 of 6
17. (drop truck-3 city-2-loc-2 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-3) (capacity truck-3 capacity-1)
   added: (at package-2 city-2-loc-2) (capacity truck-3 capacity-2)
   goals met: 5 of 6
18. (drive truck-3 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-2-loc-1)
   goals met: 5 of 6
19. (drop truck-3 city-2-loc-1 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-3) (capacity truck-3 capacity-2)
   added: (at package-1 city-2-loc-1) (capacity truck-3 capacity-3)
   goals met: 6 of 6
